app/controllers/movies_controller.rb

  def same_director
    id = params[:id]
    @movie = Movie.find(id)
    begin
      @movies = Movie.find_same_director(id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]